ИСПП/src/Catalogs/КлючиАналитикиУчетаНоменклатуры/КлючиАналитикиУчетаНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлючиАналитикиУчетаНоменклатуры</name>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </attributes>
</mdclass:Catalog>

ИСПП/src/CommonModules/ПоддержкаПроектовПереопределяемый/Module.bsl
Процедура ОбновитьКлючиАналитикиПриЗаписи(Источник, Отказ) Экспорт
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	КлючиАналитикиУчетаНоменклатуры.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
	               |ГДЕ
	               |	(КлючиАналитикиУчетаНоменклатуры.Партия = &Источник
	               |			ИЛИ КлючиАналитикиУчетаНоменклатуры.СерияНоменклатуры = &Источник)";
	Запрос.УстановитьПараметр("Источник", Источник.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		КлючАналитики = Выборка.Ссылка.ПолучитьОбъект();
		Справочники.КлючиАналитикиУчетаНоменклатуры.ЗаполнитьНаименованиеКлючаАналитики(КлючАналитики, КлючАналитики);
		КлючАналитики.Записать();
	КонецЕсли;
КонецПроцедуры

Функция ВыводитьОписаниеНоменклатуры() Экспорт
	Возврат ПолучитьФункциональнуюОпцию("ВыводитьОписаниеНоменклатурыНаПечать");
Конецфункции
